In [123]:
import pandas as pd
import numpy as np

In [124]:
#1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

arr = pd.array([10,20,30,40,50])
print(f"arr = {arr}")

arr = <IntegerArray>
[10, 20, 30, 40, 50]
Length: 5, dtype: Int64

In [125]:
#2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

arr1 = pd.Series([10,20,30,40,50])
print(arr)
n = arr1.tolist()
print(n)

<IntegerArray>
[10, 20, 30, 40, 50]
Length: 5, dtype: Int64
[10, 20, 30, 40, 50]

In [126]:
#3.Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
   #Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

arr2 = pd.Series([1,2,3,4,5])
arr3 = pd.Series([2,4,6,8,5])
print(arr2)
print(arr3)
print(f"addition = {arr2 + arr3}")
print(f"substraction = {arr2 - arr3}")
print(f"multiplication = {arr2 * arr3}")
print(f"division = {arr2 / arr3}")

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    2
1    4
2    6
3    8
4    5
dtype: int64
addition = 0     3
1     6
2     9
3    12
4    10
dtype: int64
substraction = 0   -1
1   -2
2   -3
3   -4
4    0
dtype: int64
multiplication = 0     2
1     8
2    18
3    32
4    25
dtype: int64
division = 0    0.5
1    0.5
2    0.5
3    0.5
4    1.0
dtype: float64

In [127]:
#4. Write a Pandas program to convert a dictionary to a Pandas series.

arr4 = pd.Series({"Name":"Pushpa", "business":"flower selling", "slogan":"jhukega nhi saala"})
print(arr4)

Name                   Pushpa
business       flower selling
slogan      jhukega nhi saala
dtype: object

In [128]:
#5.Write a Pandas program to convert a NumPy array to a Pandas series.

arr5 = np.array([10,20,30,40,50])
print(arr5)
arr6 = pd.Series(arr5)
print(arr6)

[10 20 30 40 50]
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [129]:
#6. Write a Pandas program to change the data type of given a column or a Series.

arr6 = pd.Series(['100', '200', 'python', '300.12', '400'])
print(arr6)
n = pd.to_numeric(arr6,errors='coerce')
print(n)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [130]:
#7. Write a Pandas program to convert a given Series to an array.

arr7 = pd.Series([10,20,30,40,50])
print(arr7)
n = arr7.values
print(n)
print(type(n))

0    10
1    20
2    30
3    40
4    50
dtype: int64
[10 20 30 40 50]
<class 'numpy.ndarray'>

In [131]:
#8. Write a Pandas program to create a dataframe from a dictionary and display it.

arr4 = pd.Series({"Name":"Pushpa", "business":"flower selling", "slogan":"jhukega nhi saala"})
arr5 = pd.Series({"Name":"Rocky", "business":"violence", "slogan":"if u are bad i am ur dad"})
arr6 = pd.Series({"Name":"Maari", "business":"drugs", "slogan":"kaat daalega"})
df = pd.DataFrame([arr4,arr5,arr6])
print(df)

     Name        business                    slogan
0  Pushpa  flower selling         jhukega nhi saala
1   Rocky        violence  if u are bad i am ur dad
2   Maari           drugs              kaat daalega

In [132]:
#9. i) Create a list of empids and names (10 employees).
#    ii) Convert list into Series.
l1 = ["empid", "Name"]
p1 = pd.Series(["1", "abc"], index = l1)
p2 = pd.Series(["2", "xyz"], index = l1)
p3 = pd.Series(["3", "pqr"], index = l1)
p4 = pd.Series(["4", "ijk"], index = l1)
p5 = pd.Series(["5", "lmn"], index = l1)
p6 = pd.Series(["6", "nml"], index = l1)
p7 = pd.Series(["7", "kji"], index = l1)
p8 = pd.Series(["8", "rqp"], index = l1)
p9 = pd.Series(["9", "zyx"], index = l1)
p10 = pd.Series(["10", "cba"], index = l1)

# iii) Print type of Series.
print(f"Type = {type(l1)}")

#   iv) Convert Series into DataFrame.
Employee = pd.DataFrame([p1,p2,p3,p4,p5,p6,p7,p8,p9,p10])

#   v) a) Display all records.
print(Employee)

# b) Display first five records.
Employee.head()

Type = <class 'list'>
  empid Name
0     1  abc
1     2  xyz
2     3  pqr
3     4  ijk
4     5  lmn
5     6  nml
6     7  kji
7     8  rqp
8     9  zyx
9    10  cba

  empid Name
0     1  abc
1     2  xyz
2     3  pqr
3     4  ijk
4     5  lmn

In [133]:
#  c) Display last five records.
Employee.tail()

  empid Name
5     6  nml
6     7  kji
7     8  rqp
8     9  zyx
9    10  cba

In [134]:
# d) Display first two and last two records.
Employee.head(2)

  empid Name
0     1  abc
1     2  xyz

In [135]:
Employee.tail(2)

  empid Name
8     9  zyx
9    10  cba

In [136]:
#e) Display name of 5th employee.
Employee.iloc[4]

empid      5
Name     lmn
Name: 4, dtype: object

In [137]:
#f) Display record of 4th employee.
Employee.iloc[3]

empid      4
Name     ijk
Name: 3, dtype: object

In [138]:
# vi) Save the record in csv file (MyRecord.csv)
Employee.to_csv('Employee')

In [139]:
#10. i) Read the MyRecord.csv file.
pd.read_csv('Employee')

   Unnamed: 0  empid Name
0           0      1  abc
1           1      2  xyz
2           2      3  pqr
3           3      4  ijk
4           4      5  lmn
5           5      6  nml
6           6      7  kji
7           7      8  rqp
8           8      9  zyx
9           9     10  cba

In [140]:
#   ii) Create a new column Salary.
Employee['Salary'] = [10000,20000,30000,40000,50000,60000,70000,80000,90000,100000]
print(Employee)

  empid Name  Salary
0     1  abc   10000
1     2  xyz   20000
2     3  pqr   30000
3     4  ijk   40000
4     5  lmn   50000
5     6  nml   60000
6     7  kji   70000
7     8  rqp   80000
8     9  zyx   90000
9    10  cba  100000

In [141]:
#11. Refer the dataset "Advertising.csv" and perform following tasks.
#i) Read the dataset "Advertising.csv" in data frame.
df = pd.read_csv('./Advertising.csv')

In [142]:
#ii) Print first five records of dataset.
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [143]:
#iii) print last five records from dataset.
df.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [144]:
#iv) display the columns inside the dataset.
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [145]:
#v) display last three records from dataset.
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [146]:
#vi) display the information about the dataset and analyse the data.
#vii) display types of each columns.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [147]:
#viii) check for null values in the dataset and display the sum of null values inside the column.
print(df.isna().sum())

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [148]:
#ix) drop a column 'radio' from a dataset and display first ten records.
df.drop(['radio'],axis=1),(df.head(10))

(        TV  newspaper  sales
 0    230.1       69.2   22.1
 1     44.5       45.1   10.4
 2     17.2       69.3    9.3
 3    151.5       58.5   18.5
 4    180.8       58.4   12.9
 ..     ...        ...    ...
 195   38.2       13.8    7.6
 196   94.2        8.1    9.7
 197  177.0        6.4   12.8
 198  283.6       66.2   25.5
 199  232.1        8.7   13.4

 [200 rows x 3 columns],
       TV  radio  newspaper  sales
 0  230.1   37.8       69.2   22.1
 1   44.5   39.3       45.1   10.4
 2   17.2   45.9       69.3    9.3
 3  151.5   41.3       58.5   18.5
 4  180.8   10.8       58.4   12.9
 5    8.7   48.9       75.0    7.2
 6   57.5   32.8       23.5   11.8
 7  120.2   19.6       11.6   13.2
 8    8.6    2.1        1.0    4.8
 9  199.8    2.6       21.2   10.6)

In [149]:
#x) increase the sales by 10% and add a new column "updated_sales" in dataframe.
df['updated_sales'] = df['sales'] + df['sales']*0.10 
print(df)

        TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1          24.31
1     44.5   39.3       45.1   10.4          11.44
2     17.2   45.9       69.3    9.3          10.23
3    151.5   41.3       58.5   18.5          20.35
4    180.8   10.8       58.4   12.9          14.19
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           8.36
196   94.2    4.9        8.1    9.7          10.67
197  177.0    9.3        6.4   12.8          14.08
198  283.6   42.0       66.2   25.5          28.05
199  232.1    8.6        8.7   13.4          14.74

[200 rows x 5 columns]

In [150]:
# xi) display the shape of data
df.shape

(200, 5)

In [151]:
#xii) describe the dataset.
df.describe()

               TV       radio   newspaper       sales  updated_sales
count  200.000000  200.000000  200.000000  200.000000     200.000000
mean   147.042500   23.264000   30.554000   14.022500      15.424750
std     85.854236   14.846809   21.778621    5.217457       5.739202
min      0.700000    0.000000    0.300000    1.600000       1.760000
25%     74.375000    9.975000   12.750000   10.375000      11.412500
50%    149.750000   22.900000   25.750000   12.900000      14.190000
75%    218.825000   36.525000   45.100000   17.400000      19.140000
max    296.400000   49.600000  114.000000   27.000000      29.700000

In [153]:
#12. Refer the dataset "Salaries.csv" and perform following tasks.
#i) Read the dataset in dataframe.
df = pd.read_csv('Salary_Data.csv')

In [154]:
#ii) display first five records.
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [155]:
#iii) display first ten records.
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [156]:
#iv) display last five records.
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [157]:
#v) display last ten records.
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [158]:
#vi) display the columns inside the dataset.
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [159]:
#vii) display shape of data.
df.shape

(33, 2)

In [161]:
#viii) describe the dataset.
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [162]:
#ix) display the information about the dataset and analyse the data.
#x) display types of each columns.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes